src/CF/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Склады</xr:Item>
				<xr:Item>Catalog.ХранилищаДенег</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетЗарплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПравовойСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравовойСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаТекстаЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулыОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыВДняхПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Сотрудники/Ext/ObjectModule.bsl
//sza140411-1702 : 
//sza131018-1445

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Сотрудники", ЭтотОбъект.ОКПО, ЭтотОбъект.Ссылка);
		
		Если не отказ  
			И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
			и не Сокрлп(ОсновнойШтрихКод) = "" тогда
			
			РезультатОбработки = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ОсновнойШтрихКод);
			
			Если ЗначениеЗаполнено(РезультатОбработки) Тогда
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка! Такой штрих-код найден (") + ОсновнойШтрихКод + "): " + РезультатОбработки.Номенклатура);
				Отказ = Истина;
				
			Иначе
				РезультатОбработки = ОбщийМодульСервер.ПолучитьСотрудникаПоШтрихКоду(ОсновнойШтрихКод);
				если ЗначениеЗаполнено(РезультатОбработки)
					И не РезультатОбработки = Ссылка Тогда
					
					ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Такой штрих код уже указан у сотрудника (") + ОсновнойШтрихКод + "): " + РезультатОбработки);
					Отказ = Истина;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;	
		
		если не отказ
			и Модифицированность() тогда
			
			массивпустыхстрок = новый массив;
			для каждого СтрокаСоставаНабора из РасчетЗарплаты цикл
				Если НЕ ЗначениеЗаполнено(СтрокаСоставаНабора.ВидНачисления)
					и не ЗначениеЗаполнено(СтрокаСоставаНабора.Размер) Тогда
					массивпустыхстрок.Добавить(СтрокаСоставаНабора);
				КонецЕсли;                                    	
			КонецЦикла;
			для каждого СтрокаСоставаНабора из массивпустыхстрок цикл
				РасчетЗарплаты.Удалить(СтрокаСоставаНабора);	
			КонецЦикла;
			
			массивпустыхстрок = новый массив;
			для каждого СтрокаСоставаНабора из склады цикл
				Если НЕ ЗначениеЗаполнено(СтрокаСоставаНабора.Склад) Тогда
					массивпустыхстрок.Добавить(СтрокаСоставаНабора);
				КонецЕсли;                                    	
			КонецЦикла;
			для каждого СтрокаСоставаНабора из массивпустыхстрок цикл
				склады.Удалить(СтрокаСоставаНабора);	
			КонецЦикла;
			
			БылиИзменения = Ложь;
			Если НЕ ЗначениеЗаполнено(клиент) Тогда
				клиентОбъект = Справочники.Клиенты.СоздатьЭлемент() ;
				БылиИзменения = Истина;
			иначе
				клиентОбъект = клиент.ПолучитьОбъект();
			КонецЕсли;
			Если ЗначениеЗаполнено(адрес) 
				и не клиентОбъект.Адрес = адрес Тогда		
				БылиИзменения = Истина;
			КонецЕсли;		
			
			ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенДляОтпускаТоваровСобственнымСотрудникам"); 
			Если ЗначениеЗаполнено(ВидЦен)
				и не клиентОбъект.ВидЦен = ВидЦен Тогда
				
				клиентОбъект.ВидЦен = ВидЦен;	
				БылиИзменения = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Комментарий) 
				и не клиентОбъект.Комментарий = Комментарий Тогда		
				
				клиентОбъект.Комментарий = Комментарий;
				БылиИзменения = Истина;
			КонецЕсли;
			
			РодительКлиент = Справочники.Клиенты.НайтиПоНаименованию(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники")) ;
			
			Если НЕ ЗначениеЗаполнено(РодительКлиент) Тогда
				
				РодительКлиентОбъект = Справочники.Клиенты.СоздатьГруппу() ;
				РодительКлиентОбъект.Наименование 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники");
				РодительКлиентОбъект.ВидЦен 		= ВидЦен;
				РодительКлиентОбъект.Записать();
				РодительКлиент = РодительКлиентОбъект.Ссылка;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РодительКлиент) 
				и РодительКлиент.ЭтоГруппа 
				и не клиентОбъект.Родитель = РодительКлиент Тогда
				
				клиентОбъект.Родитель = РодительКлиент;
				БылиИзменения = Истина;
			КонецЕсли;
			
			если не клиентОбъект.Наименование = Наименование тогда
				клиентОбъект.Наименование 			= Наименование;
				клиентОбъект.НаименованиеДляПечати 	= Наименование;    	
				БылиИзменения = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОКПО) 
				и не клиентОбъект.ОКПО = ОКПО Тогда
				
				клиентОбъект.ОКПО = ОКПО;
				БылиИзменения = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Телефон) 
				и не клиентОбъект.Телефон = Телефон Тогда
				
				клиентОбъект.Телефон = Телефон;	
				БылиИзменения = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлектроннаяПочта) 
				и не клиентОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта Тогда
				
				клиентОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта;
				БылиИзменения = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДатаРождения) 
				и не клиентОбъект.ДатаРождения = ДатаРождения Тогда
				
				клиентОбъект.ДатаРождения = ДатаРождения;
				БылиИзменения = Истина;
			КонецЕсли;
			
			если не клиентОбъект.ЭтоСотрудник тогда
				клиентОбъект.ЭтоСотрудник = истина;   	
				БылиИзменения = Истина;
			КонецЕсли;
			
			если БылиИзменения тогда
				Попытка //Записи клиентОбъект
					
					клиентОбъект.Записать();
					клиент = клиентОбъект.Ссылка;
					
				Исключение //Записи клиентОбъект
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи связанного Клиента:") + " " + клиентОбъект + " " + ОписаниеОшибки();
						//Сообщение.Сообщить();                                               	
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи связанного Клиента:") + " " + клиентОбъект + " " + ОписаниеОшибки(), , Ссылка);
					КонецЕсли;
				КонецПопытки; //Записи клиентОбъект
				
			КонецЕсли;
			
			БылиИзменения = Ложь;
			Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
				ПоставщикОбъект = Справочники.Поставщики.СоздатьЭлемент() ;
				БылиИзменения = Истина;
			иначе
				ПоставщикОбъект = Поставщик.ПолучитьОбъект();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(адрес) 
				и не ПоставщикОбъект.Адрес = адрес Тогда		
				
				БылиИзменения = Истина;
			КонецЕсли;		
			
			Если ЗначениеЗаполнено(ВидЦен)
				и не ПоставщикОбъект.ВидЦен = ВидЦен Тогда
				
				ПоставщикОбъект.ВидЦен = ВидЦен;	
				БылиИзменения = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Комментарий) 
				и не ПоставщикОбъект.Комментарий = Комментарий Тогда		
				
				ПоставщикОбъект.Комментарий = Комментарий;
				БылиИзменения = Истина;
			КонецЕсли;
			
			РодительПоставщик = Справочники.Поставщики.НайтиПоНаименованию(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники")) ;
			
			Если НЕ ЗначениеЗаполнено(РодительПоставщик) Тогда
				
				РодительПоставщикОбъект = Справочники.Поставщики.СоздатьГруппу() ;
				РодительПоставщикОбъект.Наименование = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники");
				РодительПоставщикОбъект.ВидЦен 		 = ВидЦен;
				РодительПоставщикОбъект.Записать();
				
				РодительПоставщик = РодительПоставщикОбъект.Ссылка;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РодительПоставщик) 
				и РодительПоставщик.ЭтоГруппа 
				и не ПоставщикОбъект.Родитель = РодительПоставщик Тогда
				
				ПоставщикОбъект.Родитель = РодительПоставщик;
				БылиИзменения = Истина;
			КонецЕсли;
			
			если не ПоставщикОбъект.Наименование = Наименование тогда
				ПоставщикОбъект.Наименование = Наименование;
				ПоставщикОбъект.НаименованиеДляПечати = Наименование;    	
				БылиИзменения = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОКПО) 
				и не ПоставщикОбъект.ОКПО = ОКПО Тогда
				
				ПоставщикОбъект.ОКПО = ОКПО;
				БылиИзменения = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Телефон) 
				и не ПоставщикОбъект.Телефон = Телефон Тогда
				ПоставщикОбъект.Телефон = Телефон;	
				БылиИзменения = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭлектроннаяПочта) 
				и не ПоставщикОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта Тогда
				
				ПоставщикОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта;
				БылиИзменения = Истина;
			КонецЕсли;
			
			если не ПоставщикОбъект.ЭтоСотрудник тогда
				ПоставщикОбъект.ЭтоСотрудник = истина;   	
				БылиИзменения = Истина;
			КонецЕсли;
			
			если БылиИзменения тогда
				Попытка
					
					ПоставщикОбъект.Записать();
					Поставщик = ПоставщикОбъект.Ссылка;
					
				Исключение 
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи связанного Поставщика:") + " " + ПоставщикОбъект + " " + ОписаниеОшибки();
						//Сообщение.Сообщить();                                               	
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи связанного Поставщика:") + " " + ПоставщикОбъект + " " + ОписаниеОшибки(), , Ссылка);
					КонецЕсли;
				КонецПопытки;
				
			КонецЕсли; 	
			ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка);
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ХранилищеДенег = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
